{
  "name": "Fast-Paced and Disjointed Conversation Demo",
  "description": "A scenario where participants speak quickly, interrupt each other's topics, and fail to achieve resolution, designed to trigger the 'pace_too_fast' indicator.",
  "script": [
    {
      "delay_seconds": 3,
      "participant_name": "Dr. Eva Rostova",
      "text": "Welcome everyone. Let's pick up on our theme from last week about managing energy. Who would like to share an experience from their week?"
    },
    {
      "delay_seconds": 5,
      "participant_name": "Jordan",
      "text": "I can start. This week was... a lot. I'm on this huge project, and the deadline just got moved up by a week. I feel like I'm constantly drowning and my manager just keeps adding more 'small' tasks to my plate. It's just..."
    },
    {
      "delay_seconds": 1.5,
      "participant_name": "Casey",
      "text": "Deadlines, tell me about it. My in-laws are hounding me to book our summer vacation plans. It's supposed to be a break, but planning it feels like another full-time job I don't have time for. Where do you even go with two kids who hate everything?"
    },
    {
      "delay_seconds": 2,
      "participant_name": "Jordan",
      "text": "At least your family is talking about vacations. My manager, Steve, he just communicates in one-sentence emails. No context, just 'Need this by EOD.' It's impossible to know what's actually important."
    },
    {
      "delay_seconds": 1.5,
      "participant_name": "Casey",
      "text": "Oh, clients who can't communicate are the worst! I have one who sends me design feedback through Instagram DMs at 10 PM. Last night he sent a picture of a sunset and just said 'more of this vibe.' What am I supposed to do with that?!"
    },
    {
      "delay_seconds": 2,
      "participant_name": "Jordan",
      "text": "Right? It's like you're supposed to be a mind reader. And now I have that budget meeting tomorrow that I'm not even remotely prepared for, and I completely forgot I promised to help my sister move this weekend."
    },
    {
      "delay_seconds": 2,
      "participant_name": "Casey",
      "text": "Moving is awful. My back still hurts from the last time we moved. And speaking of physical stuff, my eye has started twitching again. It only happens when a client hasn't paid an invoice."
    },
    {
      "delay_seconds": 4,
      "participant_name": "Dr. Eva Rostova",
      "text": "Jordan, Casey, I want to pause here for a moment."
    },
    {
      "delay_seconds": 5,
      "participant_name": "Dr. Eva Rostova",
      "text": "It sounds like you're both carrying an immense amount of pressure, and it's coming out very quickly. We've jumped from work deadlines, to vacation planning, to communication styles, to moving, and unpaid invoices in just a couple of minutes."
    },
    {
      "delay_seconds": 8,
      "participant_name": "Dr. Eva Rostova",
      "text": "Let's take a breath. Jordan, you started by talking about the pressure of your project deadline. Can we go back to that feeling of 'drowning' you mentioned?"
    }
  ]
}